kbladewht/TMK_nRF52833/SRC/BLE/ble_service.c
static bool              m_in_boot_mode = false;                    /**< Current protocol mode. */
static uint16_t          m_conn_handle  = BLE_CONN_HANDLE_INVALID;  /**< Handle of the current connection. */
static bool              m_caps_on = false;                         /**< Variable to indicate if Caps Lock is turned on. */
static pm_peer_id_t      m_peer_id;                                 /**< Device reference handle to the current bonded central. */
static buffer_list_t     buffer_list;                               /**< List to enqueue not just data to be sent, but also related information like the handle, connection handle etc */

static nrf_saadc_value_t adc_buf[2];                                /*buffer of adc value*/

static ble_uuid_t m_adv_uuids[] = {{BLE_UUID_HUMAN_INTERFACE_DEVICE_SERVICE, BLE_UUID_TYPE_BLE}};


/*-----------QWR Service----------*/


/**@brief Function for handling Queued Write Module errors.
 *
 * @details A pointer to this function will be passed to each service which may need to inform the
 *          application about an error.
 *
 * @param[in]   nrf_error   Error code containing information about what went wrong.
 */
void nrf_qwr_error_handler(uint32_t nrf_error)
{
    APP_ERROR_HANDLER(nrf_error);
}


/**@brief Function for initializing the Queued Write Module.
 */
void qwr_init(void)
{
    ret_code_t         err_code;
    nrf_ble_qwr_init_t qwr_init_obj = {0};

    qwr_init_obj.error_handler = nrf_qwr_error_handler;

    err_code = nrf_ble_qwr_init(&m_qwr, &qwr_init_obj);
    APP_ERROR_CHECK(err_code);
}


/*----------DIS Service----------*/
/**@brief Function for initializing Device Information Service.
 */
void dis_init(void)
{
    ret_code_t       err_code;
    ble_dis_init_t   dis_init_obj;
    ble_dis_pnp_id_t pnp_id;

    pnp_id.vendor_id_source = PNP_ID_VENDOR_ID_SOURCE;
    pnp_id.vendor_id        = PNP_ID_VENDOR_ID;
    pnp_id.product_id       = PNP_ID_PRODUCT_ID;
    pnp_id.product_version  = PNP_ID_PRODUCT_VERSION;

    memset(&dis_init_obj, 0, sizeof(dis_init_obj));

    ble_srv_ascii_to_utf8(&dis_init_obj.manufact_name_str, MANUFACTURER_NAME);
    dis_init_obj.p_pnp_id = &pnp_id;

    dis_init_obj.dis_char_rd_sec = SEC_JUST_WORKS;

    err_code = ble_dis_init(&dis_init_obj);
    APP_ERROR_CHECK(err_code);
}


/*----------Bas Service----------*/


/**@brief Function for initializing Battery Service.
 */
void bas_init(void)
{
    ret_code_t     err_code;
    ble_bas_init_t bas_init_obj;

    memset(&bas_init_obj, 0, sizeof(bas_init_obj));

    bas_init_obj.evt_handler          = NULL;
    bas_init_obj.support_notification = true;
    bas_init_obj.p_report_ref         = NULL;
    bas_init_obj.initial_batt_level   = 100;

    bas_init_obj.bl_rd_sec        = SEC_JUST_WORKS;
    bas_init_obj.bl_cccd_wr_sec   = SEC_JUST_WORKS;
    bas_init_obj.bl_report_rd_sec = SEC_JUST_WORKS;

    err_code = ble_bas_init(&m_bas, &bas_init_obj);
    APP_ERROR_CHECK(err_code);
}


// Initialized state
static bool saadc_initialized = false;

// Saadc config
static nrf_saadc_channel_config_t kb_battery_channel_config = {
    .resistor_p = NRF_SAADC_RESISTOR_DISABLED,
    .resistor_n = NRF_SAADC_RESISTOR_DISABLED,
    .gain = NRF_SAADC_GAIN1_5,
    .reference = NRF_SAADC_REFERENCE_INTERNAL,
    .acq_time = NRF_SAADC_ACQTIME_10US,
    .mode = NRF_SAADC_MODE_SINGLE_ENDED,
    .burst = NRF_SAADC_BURST_DISABLED,
    .pin_p = (nrf_saadc_input_t)(BATTERY_PIN),
    .pin_n = NRF_SAADC_INPUT_DISABLED
};


static const nrfx_saadc_config_t saadc_config = NRFX_SAADC_DEFAULT_CONFIG;
#define SAMPLES_IN_BUFFER 4
static nrf_saadc_value_t buffer_pool[2][SAMPLES_IN_BUFFER];


// power percentage func
static uint8_t trans_voltage_to_percent(uint16_t voltage)
{
    uint8_t percentage = 255; //indicates wrong result
    if (voltage > 4100){
        percentage = 100;
    }
    else if (voltage >= 3335){
        percentage = 15 + (voltage - 3335) / 9;
    }
    else if (voltage >= 2900){
        percentage = (voltage - 2900) / 29;
    }
    else if (voltage < 2900){
        percentage = 0;
    }
    return percentage;
}


static void adc_result_handler(nrf_saadc_value_t value)
{
    //saadc measure value = voltage * gain / reference * 2^10
    //gain = 1/5
    //reference = 0.6V
    //because on board the sample voltage is half of battery voltage
    //voltage in mV is value / 0.2 * 0.6 / 1024 * 1000 * 2 = value * 2.93 * 2
    uint16_t voltage = value * 2.93 * 2;
    uint8_t percentage = trans_voltage_to_percent(voltage);
    ret_code_t err_code = ble_bas_battery_level_update(&m_bas, percentage, BLE_CONN_HANDLE_ALL);
    if ((err_code != NRF_SUCCESS) && 
        (err_code != NRF_ERROR_INVALID_STATE) && 
        (err_code != NRF_ERROR_RESOURCES) && 
        (err_code != NRF_ERROR_BUSY) && 
        (err_code != BLE_ERROR_GATTS_SYS_ATTR_MISSING)){
        APP_ERROR_HANDLER(err_code);
    }
    //NRF_LOG_INFO("%d %d", voltage, percentage);
}


void adc_evt_cb(nrfx_saadc_evt_t const* event)
{
    nrf_saadc_value_t result = 0;

    if (event->type != NRFX_SAADC_EVT_DONE) {
      return;
    }

    ret_code_t err_code;
    // reload Buffer
    err_code = nrfx_saadc_buffer_convert(event->data.done.p_buffer, SAMPLES_IN_BUFFER);
    APP_ERROR_CHECK(err_code);

    // get average result
    for (uint8_t j = 0; j < SAMPLES_IN_BUFFER; j++) {
        result += event->data.done.p_buffer[j];
    }
    

    adc_result_handler(result/SAMPLES_IN_BUFFER);

    nrfx_saadc_uninit();
    saadc_initialized = false;
}


/* init adc to mesure voltage */
static void saadc_init()
{
    ret_code_t err_code;

    err_code = nrfx_saadc_init(&saadc_config, adc_evt_cb);
    APP_ERROR_CHECK(err_code);

    err_code = nrfx_saadc_channel_init(0, &kb_battery_channel_config);
    APP_ERROR_CHECK(err_code);

    err_code = nrfx_saadc_buffer_convert(buffer_pool[0], SAMPLES_IN_BUFFER);
    APP_ERROR_CHECK(err_code);

    err_code = nrfx_saadc_buffer_convert(buffer_pool[1], SAMPLES_IN_BUFFER);
    APP_ERROR_CHECK(err_code);
}


void battery_level_meas_timeout_handler(void * p_context)
{
    bool measure_started = true;

